# PANDAS

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Creating Dataframe

In [2]:
df = pd.read_csv("marks.csv")
df

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98
5  6/1/21  internal6    21    39    30     90
6  7/1/21  internal7    20    32    20     72
7  8/1/21  internal8    35    40    10     85

# Functions

## 1. df = pd.read_csv('abc_csv') and df = pd.read_excel('abc.xlsx')
### To read a csv file and an excel file
## 2. df.shape 
### Gives the order of the matrix i.e., no. of rows and columns
## 3. df.columns 
### Give all the columns
## 4. df.head() and df.tail() 
### Gives the firts 5 rows and first 5 columns
## 5. df[a:b] 
### Gives (a)th row to (b-1)th row 
## 6. df['column_name'] 
### Gives that whole column
## 7. df.column_name 
### Gives that whole column
## 8. df.[['column_a','column_b','column_c']] 
### Gives columns a,b and c
## 9. df.column_name.max() , df.column_name.min() , df.column_name.mean(), df.column_name.std() , df.column_name.describe()
### Gives the data where the column has its max, min. And gives the Mean, Standard Deviation and Stat of that column
## 10. df[df.column_a >= x] , df[df.column_a == df.column_a.max()] , etc 
### Gives data where column_a has its maximum
## 11. df['column_a'][df.column_b == df.column_b.max()] 
### Gives column_a where column_b is maximum
## 12. df.set_index('column_a') , df.set_index('column_a' , inplace=True) 
### Sets column_a as the index instead of 0,1,2,3,...
## 13. df.loc['row_a'] 
### Gives the row_a. This can be done only when index is set to some column instead of 0,1,2,3,...
## 14. df.reset_index(inplace=True) 
### Resets the index to 0,1,2,3,...
## 15. df = pd.read_csv("abc.csv", skiprows=n) or df = pd.read_csv("abc.csv", header=n) 
### skips 1st n rows
## 16. df = pd.read_csv('abc.csv', header=None, names=['a','b','c']) 
### if we haven't mentioned column names in the csv file
## 17. df = pd.read_csv("abc.csv", nrows=n) 
### Reads only first n rows excluding the header
## 18. df = pd.read_csv('abc_csv', na_values=[a,b,c])
### The values a,b,c in the data changes to "NaN"
## 19. df = pd.read_csv('abc_csv', na_values={ 'column_a' : [a,b,c] , 'column_b' : [x,y,z] })
### To make different values as NaN in different columns.
## 20. df.to_csv('xyz.csv') and df.to_csv('xyz.csv', index=Flase)
### To create another csv file with same data  AND  not to get the data along with index.
## 21. df.to_csv('xyz.csv', columns=['column_a','column_b'])
### To create another csv file with same data but only some coulmns
## 22. def convert_elements(element):
##         if element == 'not available':
##             return '0'
##         else:
##             return element
##     df = pd.read_csv('abc.csv', converters={ 'column_a' : convert_elements , 'column_b' : covert_elements })
### For example, to change the 'not available' values to '0', we define a function to change the values and then while reading the csv file, we use "converters={'column_a' : convert_elements , 'column_b' : covert_elements} to convert the 'not available' values to '0' in column_a and column_b
## 23. df.to_excel('xyz.xlsx', startrow=a, startcol=b)
### To create an excel file with same data in df and the data starts at (a)th row and (b)th column
## 24. df = pd.read_csv('abc.csv', parse_dates=['column_a'])
### To change the column_a into dates
## 25. df = df.fillna(a)
### To change the NaN values in the data into 'a'
## 26. df = df.fillna({ 'coulmn_a' : x , 'column_b' : y })
### To change the NaN values of column_a to 'x' and column_b to 'y'
## 27. df = df.fillna(method='ffill')
### To change the NaN values to the preceeding row value in each column
## 28. df = df.fillna(method='bfill')
### To change the NaN values to the succeeding row value in each column
## 29. df = df.fillna(method='ffill', axis='columns')
### To change the NaN values to the preceeding column value in each row
## 30. df = df.fillna(method='ffill', limit=1)
### For example. in a column there are 3 NaNs continuously then, "limit=1" changes only the first NaN to the preceeding row value in that column and leaves the remaining 2 NaNs as it is. Similarly, "limit=2" changes 2 NaNs to the preceeding row value in that column and leaves the remaining 1 NaN as it is
## 31. df.interpolate()
### Changes the NaN value to the average value of preceeding and succeeding values
## 32. df.dropna()
### Gives all the data except the rows having atleast 1 NaN
## 33. df.dropna(how="all")
### Gives all the data except the rows having all the elements as NaN
## 34. df.dropna(thresh=n)
### Gives all the rows having atleast n valid values (or) n non-NaN values
### df.dropna(how='all') and df.dropna(thresh=1) are same

In [3]:
df.shape

(8, 6)

In [4]:
rows,columns = df.shape
rows

8

In [5]:
columns

6

In [6]:
df.head()

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98

In [7]:
df.tail()

     date       exam  stat  math  coms  total
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98
5  6/1/21  internal6    21    39    30     90
6  7/1/21  internal7    20    32    20     72
7  8/1/21  internal8    35    40    10     85

In [8]:
df.head(3)

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89

In [9]:
df[2:6]

     date       exam  stat  math  coms  total
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98
5  6/1/21  internal6    21    39    30     90

In [10]:
df.columns

Index(['date', 'exam', 'stat', 'math', 'coms', 'total'], dtype='object')

In [11]:
df.exam

0    internal1
1    internal2
2    internal3
3    internal4
4    internal5
5    internal6
6    internal7
7    internal8
Name: exam, dtype: object

In [12]:
df.coms

0    30
1    30
2    25
3     7
4    40
5    30
6    20
7    10
Name: coms, dtype: int64

In [13]:
df[['exam','math']]

        exam  math
0  internal1    32
1  internal2    39
2  internal3    32
3  internal4    21
4  internal5    21
5  internal6    39
6  internal7    32
7  internal8    40

In [14]:
df['stat']

0    29
1    35
2    32
3    15
4    37
5    21
6    20
7    35
Name: stat, dtype: int64

In [15]:
df['stat'].max()

37

In [16]:
df['math'].mean()

32.0

In [17]:
df['math'].std()

7.596991885890475

In [18]:
df['math'].describe()

count     8.000000
mean     32.000000
std       7.596992
min      21.000000
25%      29.250000
50%      32.000000
75%      39.000000
max      40.000000
Name: math, dtype: float64

# Conditional Selection of Data

In [19]:
df[df.stat>=30]

     date       exam  stat  math  coms  total
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
4  5/1/21  internal5    37    21    40     98
7  8/1/21  internal8    35    40    10     85

In [20]:
df[df.stat==32]

     date       exam  stat  math  coms  total
2  3/1/21  internal3    32    32    25     89

In [21]:
df[df.stat==df.stat.max()]

     date       exam  stat  math  coms  total
4  5/1/21  internal5    37    21    40     98

In [22]:
df[df.stat==df['stat'].max()]

     date       exam  stat  math  coms  total
4  5/1/21  internal5    37    21    40     98

In [23]:
df[['exam','date']][df.stat==df['stat'].max()]

        exam    date
4  internal5  5/1/21

In [24]:
df

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98
5  6/1/21  internal6    21    39    30     90
6  7/1/21  internal7    20    32    20     72
7  8/1/21  internal8    35    40    10     85

In [25]:
df

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98
5  6/1/21  internal6    21    39    30     90
6  7/1/21  internal7    20    32    20     72
7  8/1/21  internal8    35    40    10     85

In [26]:
df.set_index('date', inplace=True)
df

             exam  stat  math  coms  total
date
1/1/21  internal1    29    32    30     91
2/1/21  internal2    35    39    30    104
3/1/21  internal3    32    32    25     89
4/1/21  internal4    15    21     7     43
5/1/21  internal5    37    21    40     98
6/1/21  internal6    21    39    30     90
7/1/21  internal7    20    32    20     72
8/1/21  internal8    35    40    10     85

In [27]:
df.loc['2/1/21']

exam     internal2
stat            35
math            39
coms            30
total          104
Name: 2/1/21, dtype: object

In [28]:
df.reset_index(inplace=True)
df

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98
5  6/1/21  internal6    21    39    30     90
6  7/1/21  internal7    20    32    20     72
7  8/1/21  internal8    35    40    10     85

In [29]:
df.set_index('stat',inplace=True)
df

        date       exam  math  coms  total
stat
29    1/1/21  internal1    32    30     91
35    2/1/21  internal2    39    30    104
32    3/1/21  internal3    32    25     89
15    4/1/21  internal4    21     7     43
37    5/1/21  internal5    21    40     98
21    6/1/21  internal6    39    30     90
20    7/1/21  internal7    32    20     72
35    8/1/21  internal8    40    10     85

In [30]:
df.loc[35]

        date       exam  math  coms  total
stat
35    2/1/21  internal2    39    30    104
35    8/1/21  internal8    40    10     85

In [31]:
df.reset_index(inplace=True)
df

   stat    date       exam  math  coms  total
0    29  1/1/21  internal1    32    30     91
1    35  2/1/21  internal2    39    30    104
2    32  3/1/21  internal3    32    25     89
3    15  4/1/21  internal4    21     7     43
4    37  5/1/21  internal5    21    40     98
5    21  6/1/21  internal6    39    30     90
6    20  7/1/21  internal7    32    20     72
7    35  8/1/21  internal8    40    10     85

In [32]:
marks_data = {
    'date':['1/1/21','2/1/21','3/1/21','4/1/21'],
    'exam':['internal1','internal2','internal3','internal4'],
    'stat':[23,40,32,35],
    'math':[31,32,12,27],
    'coms':[11,21,34,22]
}
df2 = pd.DataFrame(marks_data)
df2

     date       exam  stat  math  coms
0  1/1/21  internal1    23    31    11
1  2/1/21  internal2    40    32    21
2  3/1/21  internal3    32    12    34
3  4/1/21  internal4    35    27    22

In [33]:
marks = [
    ('1/1/21','internal1',23,31,11),
    ('2/1/21','internal2',23,31,11),
    ('3/1/21','internal3',23,31,11),
    ('4/1/21','internal4',23,31,11)
]
df3 = pd.DataFrame(marks , columns = ['date','exam','stat','math','coms'])
df3

     date       exam  stat  math  coms
0  1/1/21  internal1    23    31    11
1  2/1/21  internal2    23    31    11
2  3/1/21  internal3    23    31    11
3  4/1/21  internal4    23    31    11

In [34]:
df3[df3.stat==23]

     date       exam  stat  math  coms
0  1/1/21  internal1    23    31    11
1  2/1/21  internal2    23    31    11
2  3/1/21  internal3    23    31    11
3  4/1/21  internal4    23    31    11

In [35]:
mark = [
    {'date':'1/1/21', 'exam':'internal1', 'stat':40, 'math':32},
    {'date':'2/1/21', 'exam':'internal2', 'stat':40, 'math':32},
    {'date':'3/1/21', 'exam':'internal3', 'stat':40, 'math':32},
    {'date':'4/1/21', 'exam':'internal4', 'stat':40, 'math':32}
]
df4 = pd.DataFrame(mark)
df4

     date       exam  stat  math
0  1/1/21  internal1    40    32
1  2/1/21  internal2    40    32
2  3/1/21  internal3    40    32
3  4/1/21  internal4    40    32

In [36]:
df = pd.read_csv("marks.csv", skiprows=1)
df

   1/1/21  internal1  29  32  30   91
0  2/1/21  internal2  35  39  30  104
1  3/1/21  internal3  32  32  25   89
2  4/1/21  internal4  15  21   7   43
3  5/1/21  internal5  37  21  40   98
4  6/1/21  internal6  21  39  30   90
5  7/1/21  internal7  20  32  20   72
6  8/1/21  internal8  35  40  10   85

In [37]:
df = pd.read_csv("marks.csv", skiprows=4)
df

   4/1/21  internal4  15  21   7  43
0  5/1/21  internal5  37  21  40  98
1  6/1/21  internal6  21  39  30  90
2  7/1/21  internal7  20  32  20  72
3  8/1/21  internal8  35  40  10  85

In [38]:
df = pd.read_csv("marks.csv", header=4)
df

   4/1/21  internal4  15  21   7  43
0  5/1/21  internal5  37  21  40  98
1  6/1/21  internal6  21  39  30  90
2  7/1/21  internal7  20  32  20  72
3  8/1/21  internal8  35  40  10  85

In [39]:
df5 = pd.read_csv('marks2.csv')
df5

   1/1/21  internal1  29  32  30   91
0  2/1/21  internal2  35  39  30  104
1  3/1/21  internal3  32  32  25   89
2  4/1/21  internal4  15  21   7   43
3  5/1/21  internal5  37  21  40   98
4  6/1/21  internal6  21  39  30   90
5  7/1/21  internal7  20  32  20   72
6  8/1/21  internal8  35  40  10   85

In [40]:
df5 = pd.read_csv('marks2.csv', header=None, names=['date','exam','stat','math','coms'])
df5

             date  exam  stat  math  coms
1/1/21  internal1    29    32    30    91
2/1/21  internal2    35    39    30   104
3/1/21  internal3    32    32    25    89
4/1/21  internal4    15    21     7    43
5/1/21  internal5    37    21    40    98
6/1/21  internal6    21    39    30    90
7/1/21  internal7    20    32    20    72
8/1/21  internal8    35    40    10    85

In [41]:
df = pd.read_csv("marks.csv", nrows=4)
df

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43

In [42]:
df = pd.read_csv('marks.csv')
df

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98
5  6/1/21  internal6    21    39    30     90
6  7/1/21  internal7    20    32    20     72
7  8/1/21  internal8    35    40    10     85

In [43]:
df6 = pd.read_csv('marks3.csv')
df6

     date       exam           stat math  coms
0  1/1/21  internal1             29   32    30
1  2/1/21  internal2             35   39    30
2  3/1/21  internal3  not available   32    25
3  4/1/21  internal4             15   21     7
4  5/1/21  internal5             37  n.a    40
5  6/1/21  internal6             21   39    30
6  7/1/21  internal7             20   32    20
7  8/1/21  internal8             35   40    10

In [44]:
df6 = pd.read_csv('marks3.csv', na_values=['not available','n.a'])
df6

     date       exam  stat  math  coms
0  1/1/21  internal1  29.0  32.0    30
1  2/1/21  internal2  35.0  39.0    30
2  3/1/21  internal3   NaN  32.0    25
3  4/1/21  internal4  15.0  21.0     7
4  5/1/21  internal5  37.0   NaN    40
5  6/1/21  internal6  21.0  39.0    30
6  7/1/21  internal7  20.0  32.0    20
7  8/1/21  internal8  35.0  40.0    10

In [45]:
df6.to_csv('new.csv')

In [46]:
df6.to_csv('new1.csv',index=False)

In [47]:
df6.to_csv('new2.csv',columns=['exam','math'])

In [48]:
df6 = pd.read_csv('marks3.csv')
df6

     date       exam           stat math  coms
0  1/1/21  internal1             29   32    30
1  2/1/21  internal2             35   39    30
2  3/1/21  internal3  not available   32    25
3  4/1/21  internal4             15   21     7
4  5/1/21  internal5             37  n.a    40
5  6/1/21  internal6             21   39    30
6  7/1/21  internal7             20   32    20
7  8/1/21  internal8             35   40    10

In [49]:
def convert_elements(element):
    if element == 'not available' or element == 'n.a':
        return '0'
    else:
        return element

df7 = pd.read_csv('marks3.csv', converters={
    'stat' : convert_elements,
    'math' : convert_elements
})
df7

     date       exam stat math  coms
0  1/1/21  internal1   29   32    30
1  2/1/21  internal2   35   39    30
2  3/1/21  internal3    0   32    25
3  4/1/21  internal4   15   21     7
4  5/1/21  internal5   37    0    40
5  6/1/21  internal6   21   39    30
6  7/1/21  internal7   20   32    20
7  8/1/21  internal8   35   40    10

In [50]:
df7.to_excel('new3.xlsx', startrow=4, startcol=2)

In [51]:
df8 = pd.read_csv('data.csv', parse_dates=['date'])
df8

        date  stat  math  coms
0 2021-01-01  29.0  32.0  30.0
1 2021-04-01  35.0   NaN  30.0
2 2021-05-01   NaN  32.0  25.0
3 2021-06-01  15.0  21.0   7.0
4 2021-07-01  37.0   NaN  40.0
5 2021-08-01   NaN   NaN   NaN
6 2021-09-01  20.0   NaN   NaN
7 2021-10-01  35.0  40.0  10.0

In [52]:
df9 = df8.fillna(0)
df9

        date  stat  math  coms
0 2021-01-01  29.0  32.0  30.0
1 2021-04-01  35.0   0.0  30.0
2 2021-05-01   0.0  32.0  25.0
3 2021-06-01  15.0  21.0   7.0
4 2021-07-01  37.0   0.0  40.0
5 2021-08-01   0.0   0.0   0.0
6 2021-09-01  20.0   0.0   0.0
7 2021-10-01  35.0  40.0  10.0

In [53]:
df9 = df8.fillna({
    'stat' : 0,
    'math' : 0,
    'coms' : 'Fail'
})
df9

        date  stat  math  coms
0 2021-01-01  29.0  32.0  30.0
1 2021-04-01  35.0   0.0  30.0
2 2021-05-01   0.0  32.0  25.0
3 2021-06-01  15.0  21.0   7.0
4 2021-07-01  37.0   0.0  40.0
5 2021-08-01   0.0   0.0  Fail
6 2021-09-01  20.0   0.0  Fail
7 2021-10-01  35.0  40.0  10.0

In [54]:
df9 = df8.fillna(method='ffill')
df9

        date  stat  math  coms
0 2021-01-01  29.0  32.0  30.0
1 2021-04-01  35.0  32.0  30.0
2 2021-05-01  35.0  32.0  25.0
3 2021-06-01  15.0  21.0   7.0
4 2021-07-01  37.0  21.0  40.0
5 2021-08-01  37.0  21.0  40.0
6 2021-09-01  20.0  21.0  40.0
7 2021-10-01  35.0  40.0  10.0

In [55]:
df9 = df8.fillna(method='bfill')
df9

        date  stat  math  coms
0 2021-01-01  29.0  32.0  30.0
1 2021-04-01  35.0  32.0  30.0
2 2021-05-01  15.0  32.0  25.0
3 2021-06-01  15.0  21.0   7.0
4 2021-07-01  37.0  40.0  40.0
5 2021-08-01  20.0  40.0  10.0
6 2021-09-01  20.0  40.0  10.0
7 2021-10-01  35.0  40.0  10.0

In [56]:
df9 = df8.fillna(method='bfill', axis='columns')
df9

        date  stat  math  coms
0 2021-01-01  29.0  32.0  30.0
1 2021-04-01  35.0  30.0  30.0
2 2021-05-01  32.0  32.0  25.0
3 2021-06-01  15.0  21.0   7.0
4 2021-07-01  37.0  40.0  40.0
5 2021-08-01   NaT   NaT   NaT
6 2021-09-01  20.0   NaN   NaN
7 2021-10-01  35.0  40.0  10.0

In [57]:
df9 = df8.fillna(method='ffill', limit=1)
df9

        date  stat  math  coms
0 2021-01-01  29.0  32.0  30.0
1 2021-04-01  35.0  32.0  30.0
2 2021-05-01  35.0  32.0  25.0
3 2021-06-01  15.0  21.0   7.0
4 2021-07-01  37.0  21.0  40.0
5 2021-08-01  37.0   NaN  40.0
6 2021-09-01  20.0   NaN   NaN
7 2021-10-01  35.0  40.0  10.0

In [58]:
df9 = df8.fillna(method='ffill', limit=2)
df9

        date  stat  math  coms
0 2021-01-01  29.0  32.0  30.0
1 2021-04-01  35.0  32.0  30.0
2 2021-05-01  35.0  32.0  25.0
3 2021-06-01  15.0  21.0   7.0
4 2021-07-01  37.0  21.0  40.0
5 2021-08-01  37.0  21.0  40.0
6 2021-09-01  20.0   NaN  40.0
7 2021-10-01  35.0  40.0  10.0

In [59]:
df9 = df8.set_index('date')
df9

            stat  math  coms
date
2021-01-01  29.0  32.0  30.0
2021-04-01  35.0   NaN  30.0
2021-05-01   NaN  32.0  25.0
2021-06-01  15.0  21.0   7.0
2021-07-01  37.0   NaN  40.0
2021-08-01   NaN   NaN   NaN
2021-09-01  20.0   NaN   NaN
2021-10-01  35.0  40.0  10.0

In [60]:
new_df = df9.interpolate() 
new_df

            stat   math  coms
date
2021-01-01  29.0  32.00  30.0
2021-04-01  35.0  32.00  30.0
2021-05-01  25.0  32.00  25.0
2021-06-01  15.0  21.00   7.0
2021-07-01  37.0  25.75  40.0
2021-08-01  28.5  30.50  30.0
2021-09-01  20.0  35.25  20.0
2021-10-01  35.0  40.00  10.0

In [61]:
new_df = df9.interpolate(method='time')
new_df

                 stat       math       coms
date
2021-01-01  29.000000  32.000000  30.000000
2021-04-01  35.000000  32.000000  30.000000
2021-05-01  25.163934  32.000000  25.000000
2021-06-01  15.000000  21.000000   7.000000
2021-07-01  37.000000  25.672131  40.000000
2021-08-01  28.500000  30.500000  29.891304
2021-09-01  20.000000  35.327869  19.782609
2021-10-01  35.000000  40.000000  10.000000

In [62]:
df9

            stat  math  coms
date
2021-01-01  29.0  32.0  30.0
2021-04-01  35.0   NaN  30.0
2021-05-01   NaN  32.0  25.0
2021-06-01  15.0  21.0   7.0
2021-07-01  37.0   NaN  40.0
2021-08-01   NaN   NaN   NaN
2021-09-01  20.0   NaN   NaN
2021-10-01  35.0  40.0  10.0

In [63]:
new_df = df9.dropna()
new_df

            stat  math  coms
date
2021-01-01  29.0  32.0  30.0
2021-06-01  15.0  21.0   7.0
2021-10-01  35.0  40.0  10.0

In [76]:
dt = pd.date_range("2021-1-1","2021-1-10")
idx = pd.DatetimeIndex(dt)
new_df = df9.reindex(idx)
new_df

            stat  math  coms
2021-01-01  29.0  32.0  30.0
2021-01-02   NaN   NaN   NaN
2021-01-03   NaN   NaN   NaN
2021-01-04   NaN   NaN   NaN
2021-01-05   NaN   NaN   NaN
2021-01-06   NaN   NaN   NaN
2021-01-07   NaN   NaN   NaN
2021-01-08   NaN   NaN   NaN
2021-01-09   NaN   NaN   NaN
2021-01-10   NaN   NaN   NaN